In [1]:
import pandas as pd

In [2]:
date_list = [{'yyyy-mm-dd':'2000-09-24'},
            {'yyyy-mm-dd':'2002-09-24'},
            {'yyyy-mm-dd':'2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-09-24
1  2002-09-24
2  2005-12-20

In [3]:
def extract_year(column):
    return column.split('-')[0]

In [4]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [5]:
df

   yyyy-mm-dd  year
0  2000-09-24  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [6]:
def get_age(year, current_year):
    return current_year - int(year)

In [7]:
df['age'] = df['year'].apply(get_age, current_year=2018)

In [8]:
df

   yyyy-mm-dd  year  age
0  2000-09-24  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13

In [15]:
def get_introduce(age, prefix, suffix):
    return prefix + str(age) + suffix

In [16]:
df['introduce'] = df['age'].apply(get_introduce, prefix='I am', suffix = 'years old')

In [17]:
df

   yyyy-mm-dd  year  age        introduce
0  2000-09-24  2000   18  I am18years old
1  2002-09-24  2002   16  I am16years old
2  2005-12-20  2005   13  I am13years old

In [19]:
def get_imtroduce_2(row):
    return "I was born in" + str(row.year)+ 'my age is' + str(row.age)

In [20]:
df.introduce = df.apply(get_imtroduce_2, axis=1)

In [21]:
df

   yyyy-mm-dd  year  age                     introduce
0  2000-09-24  2000   18  I was born in2000my age is18
1  2002-09-24  2002   16  I was born in2002my age is16
2  2005-12-20  2005   13  I was born in2005my age is13